example-advanced/figures/dabs_visualization/puml/test.puml
@startuml
!theme plain
package "mlops_stacks - test (mode: unknown)\n(host: https://adb-xxxx.xx.azuredatabricks.net)" {
  package "Jobs" as Jobs_test {
    rectangle "test-mlops_stacks-batch-inference-job\nnotify on_failure: first@company.com, second@company.com" as jobs_batch_inference_job_test
    package "Workflow" as Workflow_batch_inference_job_test {
      jobs_batch_inference_job_test --> Workflow_batch_inference_job_test : contains
      package "batch_inference_job\n(notebook)" as task_batch_inference_job_batch_inference_job_test {
        rectangle "env\ninput_table_name\noutput_table_name\nmodel_name\ngit_source_info\n" as git_source_info_parameters_task_batch_inference_job_batch_inference_job_test
      }
    }
    rectangle "Cluster: batch_inference_job_cluster\n13.3.x-cpu-ml-scala2.12, m7g.large, " as job_cluster_batch_inference_job_batch_inference_job_cluster_test
    jobs_batch_inference_job_test --> job_cluster_batch_inference_job_batch_inference_job_cluster_test : uses
    rectangle "test-mlops_stacks-model-training-job" as jobs_model_training_job_test
    package "Workflow" as Workflow_model_training_job_test {
      jobs_model_training_job_test --> Workflow_model_training_job_test : contains
      package "Train\n(notebook)" as task_model_training_job_Train_test {
        rectangle "env\ntraining_data_path\nexperiment_name\nmodel_name\ngit_source_info\n" as git_source_info_parameters_task_model_training_job_Train_test
      }
      package "ModelValidation\n(notebook)" as task_model_training_job_ModelValidation_test {
      task_model_training_job_Train_test --> task_model_training_job_ModelValidation_test : depends on
        rectangle "experiment_name\nrun_mode\nenable_baseline_comparison\nvalidation_input\nmodel_type\ntargets\ncustom_metrics_loader_function\nvalidation_thresholds_loader_function\nevaluator_config_loader_function\ngit_source_info\n" as git_source_info_parameters_task_model_training_job_ModelValidation_test
      }
      package "ModelDeployment\n(notebook)" as task_model_training_job_ModelDeployment_test {
      task_model_training_job_ModelValidation_test --> task_model_training_job_ModelDeployment_test : depends on
        rectangle "env\ngit_source_info\n" as git_source_info_parameters_task_model_training_job_ModelDeployment_test
      }
    }
    rectangle "Cluster: model_training_job_cluster\n13.3.x-cpu-ml-scala2.12, Standard_D3_v2, " as job_cluster_model_training_job_model_training_job_cluster_test
    jobs_model_training_job_test --> job_cluster_model_training_job_model_training_job_cluster_test : uses
  }
}
@enduml
